<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"18415320a67fa49c9c007437af300e819edad0f1a47d6577309b4c6d5473c894","plan_job_ref":"Job Create terraform plan #11 at https://github.com/leonitousconforti/infra/actions/runs/15407574838","plan_out_hash":"507dc10486d9f1d329d547c30904dd364e67b17d1302e4e2d27920ac483564de","plan_hash":"29d649cb99c1f86843e1d10156c87ebe27374eb7432ddf59cff9e02d7c3a2bea","plan_text_format":"diff","version":"2.0.0"} -->
Terraform plan in __ltgk.page__<details open><summary>With variables</summary>

```hcl
porkbun_api_key    = (sensitive value)
porkbun_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # digitalocean_domain.ltgk_page will be created
+   resource "digitalocean_domain" "ltgk_page" {
+       id   = (known after apply)
+       name = "ltgk.page"
+       ttl  = (known after apply)
+       urn  = (known after apply)
    }

  # digitalocean_record.ns1 will be created
+   resource "digitalocean_record" "ns1" {
+       domain = "ltgk.page"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "ltgk.page"
+       ttl    = 1800
+       type   = "NS"
+       value  = "ns1.digitalocean.com"
    }

  # digitalocean_record.ns2 will be created
+   resource "digitalocean_record" "ns2" {
+       domain = "ltgk.page"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "ltgk.page"
+       ttl    = 1800
+       type   = "NS"
+       value  = "ns2.digitalocean.com"
    }

  # digitalocean_record.ns3 will be created
+   resource "digitalocean_record" "ns3" {
+       domain = "ltgk.page"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "ltgk.page"
+       ttl    = 1800
+       type   = "NS"
+       value  = "ns3.digitalocean.com"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #11](https://github.com/leonitousconforti/infra/actions/runs/15407574838)